
# State **`s3://infrahouse-github-state/github.state`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       3 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                           |
|:--------:|:--------------------------------------------------------------------|
|    🟢     | `module.ih_8_repos["aws-s3-control"].github_branch_default.main`    |
|    🟢     | `module.ih_8_repos["aws-s3-control"].github_branch_protection.main` |
|    🟢     | `module.ih_8_repos["aws-s3-control"].github_repository.repo`        |
|    🟢     | `module.ih_8_repos["github-control"].github_repository.repo:`       |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/8b392c56-a033-401e-9065-b123301e8c6b/terraform-bin plan -var-file=configuration.tfvars --out=tf.plan
module.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]
github_organization_settings.infrahouse: Refreshing state... [id=121984263]
github_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]
github_team.dev: Refreshing state... [id=7332815]
module.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]
module.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]
aws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]
github_team_members.dev: Refreshing state... [id=7332815]
module.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]
module.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]
module.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]
data.aws_secretsmanager_secret_version.pypi_api_token: Reading...
data.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P|AWSCURRENT]
github_actions_secret.pypi_api_token["infrahouse-toolkit"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]
module.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]
module.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]
module.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ih_8_repos["aws-s3-control"].github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "main"
      + id         = (known after apply)
      + rename     = false
      + repository = "aws-s3-control"
    }

  # module.ih_8_repos["aws-s3-control"].github_branch_protection.main will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + contexts = [
              + "Terraform Plan",
            ]
          + strict   = true
        }
    }

  # module.ih_8_repos["aws-s3-control"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "InfraHouse Terraform State Buckets"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "aws-s3-control"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: module.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]%0Agithub_organization_settings.infrahouse: Refreshing state... [id=121984263]%0Agithub_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]%0Agithub_team.dev: Refreshing state... [id=7332815]%0Amodule.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]%0Amodule.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]%0Aaws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]%0Agithub_team_members.dev: Refreshing state... [id=7332815]%0Amodule.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]%0Amodule.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]%0Amodule.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Reading...%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P|AWSCURRENT]%0Agithub_actions_secret.pypi_api_token["infrahouse-toolkit"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]%0Amodule.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]%0Amodule.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]%0Amodule.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.ih_8_repos["aws-s3-control"].github_branch_default.main will be created%0A  + resource "github_branch_default" "main" {%0A      + branch     = "main"%0A      + id         = (known after apply)%0A      + rename     = false%0A      + repository = "aws-s3-control"%0A    }%0A%0A  # module.ih_8_repos["aws-s3-control"].github_branch_protection.main will be created%0A  + resource "github_branch_protection" "main" {%0A      + allows_deletions                = false%0A      + allows_force_pushes             = false%0A      + blocks_creations                = false%0A      + enforce_admins                  = false%0A      + id                              = (known after apply)%0A      + lock_branch                     = false%0A      + pattern                         = "main"%0A      + repository_id                   = (known after apply)%0A      + require_conversation_resolution = false%0A      + require_signed_commits          = false%0A      + required_linear_history         = false%0A%0A      + required_pull_request_reviews {%0A          + require_last_push_approval      = false%0A          + required_approving_review_count = 0%0A        }%0A%0A      + required_status_checks {%0A          + contexts = [%0A              + "Terraform Plan",%0A            ]%0A          + strict   = true%0A        }%0A    }%0A%0A  # module.ih_8_repos["aws-s3-control"].github_repository.repo will be created%0A  + resource "github_repository" "repo" {%0A      + allow_auto_merge            = false%0A      + allow_merge_commit          = true%0A      + allow_rebase_merge          = true%0A      + allow_squash_merge          = true%0A      + archived                    = false%0A      + default_branch              = (known after apply)%0A      + delete_branch_on_merge      = false%0A      + description                 = "InfraHouse Terraform State Buckets"%0A      + etag                        = (known after apply)%0A      + full_name                   = (known after apply)%0A      + git_clone_url               = (known after apply)%0A      + has_downloads               = false%0A      + has_issues                  = true%0A      + has_projects                = false%0A      + has_wiki                    = false%0A      + html_url                    = (known after apply)%0A      + http_clone_url              = (known after apply)%0A      + id                          = (known after apply)%0A      + merge_commit_message        = "PR_TITLE"%0A      + merge_commit_title          = "MERGE_MESSAGE"%0A      + name                        = "aws-s3-control"%0A      + node_id                     = (known after apply)%0A      + private                     = (known after apply)%0A      + repo_id                     = (known after apply)%0A      + squash_merge_commit_message = "COMMIT_MESSAGES"%0A      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"%0A      + ssh_clone_url               = (known after apply)%0A      + svn_url                     = (known after apply)%0A      + visibility                  = (known after apply)%0A      + vulnerability_alerts        = true%0A%0A      + security_and_analysis {%0A          + advanced_security {%0A              + status = (known after apply)%0A            }%0A%0A          + secret_scanning {%0A              + status = (known after apply)%0A            }%0A%0A          + secret_scanning_push_protection {%0A              + status = (known after apply)%0A            }%0A        }%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLXN0YXRlL2dpdGh1Yi5zdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAiW2NvbW1hbmRdL2hvbWUvcnVubmVyL3dvcmsvX3RlbXAvOGIzOTJjNTYtYTAzMy00MDFlLTkwNjUtYjEyMzMwMWU4YzZiL3RlcnJhZm9ybS1iaW4gcGxhbiAtdmFyLWZpbGU9Y29uZmlndXJhdGlvbi50ZnZhcnMgLS1vdXQ9dGYucGxhblxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9vcmdhbml6YXRpb25fc2V0dGluZ3MuaW5mcmFob3VzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MTIxOTg0MjYzXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX21lbWJlcnNoaXAuaW5mcmFob3VzZVtcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2U6YWt1em1pbnNreV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl90ZWFtLmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9JMnZ1N000Q0FpY2ldXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LnB5cGlfYXBpX3Rva2VuOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fUFlQSV9BUElfVE9LRU4tZGhJSTlQXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX3RlYW1fbWVtYmVycy5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTVdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucHlwaV9hcGlfdG9rZW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi1kaElJOVB8QVdTQ1VSUkVOVF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9hY3Rpb25zX3NlY3JldC5weXBpX2FwaV90b2tlbltcImluZnJhaG91c2UtdG9vbGtpdFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OlBZUElfQVBJX1RPS0VOXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS10b29sa2l0XVx1MDAxYlswbVxuXG5UZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gIFx1MDAxYlszMm0rXHUwMDFiWzBtIGNyZWF0ZVxuXHUwMDFiWzBtXG5UZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczpcblxuXHUwMDFiWzFtICAjIG1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW5cdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkXHUwMDFiWzBtXHUwMDFiWzBtXG5cdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX2JyYW5jaF9kZWZhdWx0XCIgXCJtYWluXCIge1xuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYnJhbmNoXHUwMDFiWzBtXHUwMDFiWzBtICAgICA9IFwibWFpblwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVuYW1lXHUwMDFiWzBtXHUwMDFiWzBtICAgICA9IGZhbHNlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXBvc2l0b3J5XHUwMDFiWzBtXHUwMDFiWzBtID0gXCJhd3MtczMtY29udHJvbFwiXG4gICAgfVxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpblx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWRcdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfYnJhbmNoX3Byb3RlY3Rpb25cIiBcIm1haW5cIiB7XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd3NfZGVsZXRpb25zXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFsbG93c19mb3JjZV9wdXNoZXNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYmxvY2tzX2NyZWF0aW9uc1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1lbmZvcmNlX2FkbWluc1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWlkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1sb2NrX2JyYW5jaFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXBhdHRlcm5cdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICAgPSBcIm1haW5cIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVwb3NpdG9yeV9pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcXVpcmVfY29udmVyc2F0aW9uX3Jlc29sdXRpb25cdTAwMWJbMG1cdTAwMWJbMG0gPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVxdWlyZV9zaWduZWRfY29tbWl0c1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICA9IGZhbHNlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXF1aXJlZF9saW5lYXJfaGlzdG9yeVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgID0gZmFsc2VcblxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtcmVxdWlyZWRfcHVsbF9yZXF1ZXN0X3Jldmlld3Mge1xuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcXVpcmVfbGFzdF9wdXNoX2FwcHJvdmFsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgPSBmYWxzZVxuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcXVpcmVkX2FwcHJvdmluZ19yZXZpZXdfY291bnRcdTAwMWJbMG1cdTAwMWJbMG0gPSAwXG4gICAgICAgIH1cblxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtcmVxdWlyZWRfc3RhdHVzX2NoZWNrcyB7XG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtY29udGV4dHNcdTAwMWJbMG1cdTAwMWJbMG0gPSBbXG4gICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVwiVGVycmFmb3JtIFBsYW5cIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdHJpY3RcdTAwMWJbMG1cdTAwMWJbMG0gICA9IHRydWVcbiAgICAgICAgfVxuICAgIH1cblxuXHUwMDFiWzFtICAjIG1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwb1x1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWRcdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeVwiIFwicmVwb1wiIHtcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFsbG93X2F1dG9fbWVyZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICA9IGZhbHNlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19tZXJnZV9jb21taXRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSB0cnVlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19yZWJhc2VfbWVyZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSB0cnVlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19zcXVhc2hfbWVyZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSB0cnVlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hcmNoaXZlZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZGVmYXVsdF9icmFuY2hcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZGVsZXRlX2JyYW5jaF9vbl9tZXJnZVx1MDAxYlswbVx1MDAxYlswbSAgICAgID0gZmFsc2VcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWRlc2NyaXB0aW9uXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICA9IFwiSW5mcmFIb3VzZSBUZXJyYWZvcm0gU3RhdGUgQnVja2V0c1wiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1ldGFnXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1mdWxsX25hbWVcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1naXRfY2xvbmVfdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1oYXNfZG93bmxvYWRzXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaGFzX2lzc3Vlc1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgID0gdHJ1ZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaGFzX3Byb2plY3RzXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWhhc193aWtpXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1odG1sX3VybFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1odHRwX2Nsb25lX3VybFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1tZXJnZV9jb21taXRfbWVzc2FnZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgPSBcIlBSX1RJVExFXCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbW1lcmdlX2NvbW1pdF90aXRsZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICA9IFwiTUVSR0VfTUVTU0FHRVwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1uYW1lXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgPSBcImF3cy1zMy1jb250cm9sXCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbW5vZGVfaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXByaXZhdGVcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcG9faWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXNxdWFzaF9tZXJnZV9jb21taXRfbWVzc2FnZVx1MDAxYlswbVx1MDAxYlswbSA9IFwiQ09NTUlUX01FU1NBR0VTXCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXNxdWFzaF9tZXJnZV9jb21taXRfdGl0bGVcdTAwMWJbMG1cdTAwMWJbMG0gICA9IFwiQ09NTUlUX09SX1BSX1RJVExFXCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXNzaF9jbG9uZV91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXN2bl91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXZpc2liaWxpdHlcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXZ1bG5lcmFiaWxpdHlfYWxlcnRzXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICA9IHRydWVcblxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtc2VjdXJpdHlfYW5kX2FuYWx5c2lzIHtcbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1hZHZhbmNlZF9zZWN1cml0eSB7XG4gICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXN0YXR1c1x1MDAxYlswbVx1MDAxYlswbSA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgIH1cblxuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbXNlY3JldF9zY2FubmluZyB7XG4gICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXN0YXR1c1x1MDAxYlswbVx1MDAxYlswbSA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgIH1cblxuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbXNlY3JldF9zY2FubmluZ19wdXNoX3Byb3RlY3Rpb24ge1xuICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdGF0dXNcdTAwMWJbMG1cdTAwMWJbMG0gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICB9XG4gICAgICAgIH1cbiAgICB9XG5cblx1MDAxYlswbVx1MDAxYlsxbVBsYW46XHUwMDFiWzBtIDMgdG8gYWRkLCAwIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LlxuXHUwMDFiWzBtXHUwMDFiWzkwbVxuXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUwMDFiWzBtXG5cblNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuXG5cblRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OlxuICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIlxuOjpkZWJ1Zzo6VGVycmFmb3JtIGV4aXRlZCB3aXRoIGNvZGUgMC5cbjo6ZGVidWc6OnN0ZG91dDogXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfb3JnYW5pemF0aW9uX3NldHRpbmdzLmluZnJhaG91c2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTEyMTk4NDI2M11cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfbWVtYmVyc2hpcC5pbmZyYWhvdXNlW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZTpha3V6bWluc2t5XVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl90ZWFtLmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1CUFJfa3dET0kydnU3TTRDQWljaV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LnB5cGlfYXBpX3Rva2VuOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fUFlQSV9BUElfVE9LRU4tZGhJSTlQXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl90ZWFtX21lbWJlcnMuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXRdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnB5cGlfYXBpX3Rva2VuOiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucHlwaV9hcGlfdG9rZW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi1kaElJOVB8QVdTQ1VSUkVOVF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfYWN0aW9uc19zZWNyZXQucHlwaV9hcGlfdG9rZW5bXCJpbmZyYWhvdXNlLXRvb2xraXRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdDpQWVBJX0FQSV9UT0tFTl1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2UtdG9vbGtpdF1cdTAwMWJbMG0lMEElMEFUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uJTBBcGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOiUwQSAgXHUwMDFiWzMybStcdTAwMWJbMG0gY3JlYXRlJTBBXHUwMDFiWzBtJTBBVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6JTBBJTBBXHUwMDFiWzFtICAjIG1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW5cdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkXHUwMDFiWzBtXHUwMDFiWzBtJTBBXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9icmFuY2hfZGVmYXVsdFwiIFwibWFpblwiIHslMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1icmFuY2hcdTAwMWJbMG1cdTAwMWJbMG0gICAgID0gXCJtYWluXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlbmFtZVx1MDAxYlswbVx1MDAxYlswbSAgICAgPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcG9zaXRvcnlcdTAwMWJbMG1cdTAwMWJbMG0gPSBcImF3cy1zMy1jb250cm9sXCIlMEEgICAgfSUwQSUwQVx1MDAxYlsxbSAgIyBtb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZFx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfYnJhbmNoX3Byb3RlY3Rpb25cIiBcIm1haW5cIiB7JTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dzX2RlbGV0aW9uc1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dzX2ZvcmNlX3B1c2hlc1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYmxvY2tzX2NyZWF0aW9uc1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZW5mb3JjZV9hZG1pbnNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1sb2NrX2JyYW5jaFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1wYXR0ZXJuXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJtYWluXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXBvc2l0b3J5X2lkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcXVpcmVfY29udmVyc2F0aW9uX3Jlc29sdXRpb25cdTAwMWJbMG1cdTAwMWJbMG0gPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcXVpcmVfc2lnbmVkX2NvbW1pdHNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcXVpcmVkX2xpbmVhcl9oaXN0b3J5XHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgPSBmYWxzZSUwQSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbXJlcXVpcmVkX3B1bGxfcmVxdWVzdF9yZXZpZXdzIHslMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVxdWlyZV9sYXN0X3B1c2hfYXBwcm92YWxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICA9IGZhbHNlJTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcXVpcmVkX2FwcHJvdmluZ19yZXZpZXdfY291bnRcdTAwMWJbMG1cdTAwMWJbMG0gPSAwJTBBICAgICAgICB9JTBBJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtcmVxdWlyZWRfc3RhdHVzX2NoZWNrcyB7JTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWNvbnRleHRzXHUwMDFiWzBtXHUwMDFiWzBtID0gWyUwQSAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXCJUZXJyYWZvcm0gUGxhblwiLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3RyaWN0XHUwMDFiWzBtXHUwMDFiWzBtICAgPSB0cnVlJTBBICAgICAgICB9JTBBICAgIH0lMEElMEFcdTAwMWJbMW0gICMgbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZFx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeVwiIFwicmVwb1wiIHslMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19hdXRvX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFsbG93X21lcmdlX2NvbW1pdFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICA9IHRydWUlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19yZWJhc2VfbWVyZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSB0cnVlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dfc3F1YXNoX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gdHJ1ZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFyY2hpdmVkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZGVmYXVsdF9icmFuY2hcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWRlbGV0ZV9icmFuY2hfb25fbWVyZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZGVzY3JpcHRpb25cdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgID0gXCJJbmZyYUhvdXNlIFRlcnJhZm9ybSBTdGF0ZSBCdWNrZXRzXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1ldGFnXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZnVsbF9uYW1lXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWdpdF9jbG9uZV91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1oYXNfZG93bmxvYWRzXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWhhc19pc3N1ZXNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICA9IHRydWUlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1oYXNfcHJvamVjdHNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWhhc193aWtpXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaHRtbF91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWh0dHBfY2xvbmVfdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbWVyZ2VfY29tbWl0X21lc3NhZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgID0gXCJQUl9USVRMRVwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbWVyZ2VfY29tbWl0X3RpdGxlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1uYW1lXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgPSBcImF3cy1zMy1jb250cm9sXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1ub2RlX2lkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcHJpdmF0ZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcG9faWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zcXVhc2hfbWVyZ2VfY29tbWl0X21lc3NhZ2VcdTAwMWJbMG1cdTAwMWJbMG0gPSBcIkNPTU1JVF9NRVNTQUdFU1wiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3F1YXNoX21lcmdlX2NvbW1pdF90aXRsZVx1MDAxYlswbVx1MDAxYlswbSAgID0gXCJDT01NSVRfT1JfUFJfVElUTEVcIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXNzaF9jbG9uZV91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdm5fdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtdmlzaWJpbGl0eVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXZ1bG5lcmFiaWxpdHlfYWxlcnRzXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICA9IHRydWUlMEElMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1zZWN1cml0eV9hbmRfYW5hbHlzaXMgeyUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1hZHZhbmNlZF9zZWN1cml0eSB7JTBBICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdGF0dXNcdTAwMWJbMG1cdTAwMWJbMG0gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICAgfSUwQSUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1zZWNyZXRfc2Nhbm5pbmcgeyUwQSAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3RhdHVzXHUwMDFiWzBtXHUwMDFiWzBtID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICAgIH0lMEElMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtc2VjcmV0X3NjYW5uaW5nX3B1c2hfcHJvdGVjdGlvbiB7JTBBICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdGF0dXNcdTAwMWJbMG1cdTAwMWJbMG0gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBXHUwMDFiWzBtXHUwMDFiWzFtUGxhbjpcdTAwMWJbMG0gMyB0byBhZGQsIDAgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuJTBBXHUwMDFiWzBtXHUwMDFiWzkwbSUwQVx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MDAxYlswbSUwQSUwQVNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuJTBBJTBBVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6JTBBICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIiUwQVxuOjpkZWJ1Zzo6c3RkZXJyOiBcbjo6ZGVidWc6OmV4aXRjb2RlOiAwXG4iLCAic3RkZXJyIjogIiIsICJhZGQiOiAzLCAiY2hhbmdlIjogMCwgImRlc3Ryb3kiOiAwfX0=```
</p></details>